/datum/quirk/cursed_blood
	name = "Проклятая Кровь"
	desc = "На вашем роду лежит проклятие бледной крови. Лучше держаться подальше от святой воды... а вот адской воды, напротив..."
	value = 0
	mob_trait = TRAIT_CURSED_BLOOD
	gain_text = span_notice("Проклятие с земель, где люди возвращаются зверьми, течёт в вашей крови.")
	lose_text = span_notice("Вы чувствуете, что тяжесть проклятия крови наконец пропала.")
	medical_record_text = "Организм пациента по неизвестной причине отторгает святые реагенты. Рекомендуется держать подальше от капеллана."
